Revit 2026 API

# EnergyAnalysisDetailModelGetAnalyticalShadingSurfaces Method

---

The collection of analytical shading surfaces.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<EnergyAnalysisSurface> GetAnalyticalShadingSurfaces()
```
```vb
Public Function GetAnalyticalShadingSurfaces As IList(Of EnergyAnalysisSurface)
```
```cpp
public:
IList<EnergyAnalysisSurface^>^ GetAnalyticalShadingSurfaces()
```
```fsharp
member GetAnalyticalShadingSurfaces : unit -> IList<EnergyAnalysisSurface>
```

#### Return Value

IListEnergyAnalysisSurface Returns the analytical shading surfaces after model calculation.

#### Reference

EnergyAnalysisDetailModel Class

Autodesk.Revit.DB.Analysis Namespace